Revit 2027 API
ConnectionValidationInfo Class
 This object contains information about fabrication connection validations.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ConnectionValidationInfo
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ConnectionValidationInfo : IDisposable
Public Class ConnectionValidationInfo
	Implements IDisposable
public ref class ConnectionValidationInfo : IDisposable
type ConnectionValidationInfo =
    class
        interface IDisposable
    end
The ConnectionValidationInfo type exposes the following members.
Constructors
Name | Description
ConnectionValidationInfo |  Constructor.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ConnectionValidationInfo
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
GetWarning |  Access specific warning number of warnings generated by reload.
IsValidWarningIndex |  Validate warning index.
ManyWarnings |  Returns number of warnings generated by reload.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace